[
    {
      
      "question": "Difference between Sql and Nosql?",
      "img": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20191104165821/SQL-Vs-NoSQL1.png",
      "cover_img":"https://miro.medium.com/max/1200/1*d3EJxXuQOK-ktAJkovdqSA.jpeg",
      "CATEGORY": "NoSQL",
      "ans_p_one": "SQL is the programming language used to interface with relational databases. (Relational databases model data as records in rows and tables with logical links between them). NoSQL is a class of DBMs that are non-relational and generally do not use SQL.",
      "ans_p_two": " SQL databases are efficient at processing queries and joining data across tables, making it easier to perform complex queries against structured data, including ad hoc requests. NoSQL databases lack consistency across products and typically require more work to query data, particular as query complexity increases."
      
    },
    
    {
      
      "question": "What is JWT, and how does it work?",
      "img": "https://i.ytimg.com/vi/K6pwjJ5h0Gg/maxresdefault.jpg",
      "cover_img":"https://supertokens.com/static/b0172cabbcd583dd4ed222bdb83fc51a/9af93/jwt-structure.png",
      "CATEGORY": "JWT Token",
      "ans_p_one": "What is JWT (JSON Web Token)? JSON Web Token (JWT) is an open standard (RFC 7519) for securely transmitting information between parties as JSON object. It is compact, readable and digitally signed using a private key/ or a public key pair by the Identity Provider(IdP).",
      "ans_p_two": " Why do we use JWT?Information Exchange: JWTs are a good way of securely transmitting information between parties because they can be signed, which means you can be sure that the senders are who they say they are. Additionally, the structure of a JWT allows you to verify that the content hasn't been tampered with.."

    },
    {
      
      "question": " What is the difference between javascript and NodeJS?",
      "img": "https://cdn.educba.com/academy/wp-content/uploads/2018/07/Java-Script-vs-Node-JS-1.png",
      "cover_img":"https://www.atliq.com/wp-content/uploads/2022/06/Know-the-difference-between-javascript-and-node-js-4-1024x576.jpg",
      "CATEGORY": "Node JS",
      "ans_p_one": "JavaScript is a simple programming language that can be used with any browser that has the JavaScript Engine installed. Node. js, on the other hand, is an interpreter or execution environment for the JavaScript programming language.",
      "ans_p_two": "Node. js is a cross-platform JavaScript runtime environment for servers and applications. It is built on a single-threaded, non-blocking event loop, the Google Chrome V8 JavaScript engine, and a low-level I/O API.."

    },
    {
      
      "question": " How does NodeJS handle multiple requests at the same time?",
      "img": "https://static.wixstatic.com/media/1af9b8_29fb337cd2b3490996cb3be50a8892a9~mv2.jpg/v1/fit/w_730%2Ch_524%2Cal_c%2Cq_80/file.jpg",
      "cover_img":"https://forum.golibrary.co/wp-content/uploads/2020/04/nodejs.png",
      "CATEGORY": "Node Js",
      "ans_p_one": "How NodeJS handle multiple client requests? NodeJS receives multiple client requests and places them into EventQueue. NodeJS is built with the concept of event-driven architecture. NodeJS has its own EventLoop which is an infinite loop that receives requests and processes them.",
      "ans_p_two": " Multiple clients make multiple requests to the NodeJS server. NodeJS receives these requests and places them into the EventQueue . NodeJS server has an internal component referred to as the EventLoop which is an infinite loop that receives requests and processes them. This EventLoop is single threaded."

    }
    
  ]